package com.example.excel;

import cn.hutool.core.io.FileUtil;
import cn.hutool.poi.excel.ExcelReader;
import cn.hutool.poi.excel.ExcelUtil;

import java.util.List;
import java.util.Map;

/**
 * 读取为Map列表，默认第一行为标题行，Map中的key为标题，value为标题对应的单元格值
 * @author baiyang
 * @date 2021/6/22
 */
public class ReadExcelDemo1 {
    public static void main(String [] args){
        ExcelReader reader = ExcelUtil.getReader(FileUtil.file("C:\\Users\\qianyy\\Downloads\\新塘1标2021年8月实际进度(1).xlsx"));
        List<Map<String, Object>> list = reader.readAll();
        list.stream().forEach(map->{
            System.out.println(map);
        });

        /**
         * {实体单元名称=013#>碎石土垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =15127923e9164b94bcb676166cc2d87c}
         * {实体单元名称=009#>砂垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =6ec20ff2e16c4dcdbabea373e1a0f390}
         * {实体单元名称=001#>总则(造价扩展), （实际）开始时间=2021-03-01, （实际）结束时间=2021-04-28, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=, 实体单元编码 =1336925941584fb1ac5d3bc852fb018e}
         * {实体单元名称=004#>石方路基, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =98b6467fc39242e799626d4c3f9e5222}
         * {实体单元名称=003#>石方路基, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =8702732a413a4073844ad703fd192ee3}
         * {实体单元名称=005#>土工合成材料处治层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =b53f7b68668c4864acb3a8730b8342d8}
         * {实体单元名称=008#>塑料排水板, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =7a22df8c7d184e7cba2ce1fbcb5b0077}
         * {实体单元名称=007#>袋装砂井, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =af95e4c759904e69b36b858ddfa0444e}
         * {实体单元名称=006#>砂垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =f7405b78c15640bb812b6b90d93e0684}
         * {实体单元名称=011#>碎石垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =e5816bf465664e52a7004063d06e9d34}
         * {实体单元名称=014#>碎石垫层, （实际）开始时间=2021-01-01, （实际）结束时间=2021-01-14, 截止上月末累计完成比例（%）=100.0, 本月实际完成比例（%）=, 实体单元编码 =067c8643f2654c5f886c758845a8aa3f}
         * {实体单元名称=015#>碎石土垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =a99d69680f43488999de373ddc2c827f}
         * {实体单元名称=010#>塑料排水板, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =31eb51bc2d634767bc14862aad0a788f}
         * {实体单元名称=002#>土方路基, （实际）开始时间=2021-01-03, （实际）结束时间=2021-04-28, 截止上月末累计完成比例（%）=50.0, 本月实际完成比例（%）=, 实体单元编码 =2c232da79fee41fc9e8dc66debe02d14}
         * {实体单元名称=012#>碎石土垫层, （实际）开始时间=2021-03-01, （实际）结束时间=, 截止上月末累计完成比例（%）=0.0, 本月实际完成比例（%）=50.0, 实体单元编码 =b8760ee1072c43f5be33701d49403430}
         */
    }
}
